{
  "averages": {
    "topic": "Averages",
    "description": "Averages involve finding the mean or central value of a set of numbers, a fundamental concept in aptitude tests and reasoning assessments. Understanding averages helps in analyzing data and solving problems efficiently across various contexts, including weighted averages, median, and mode calculations.",
    "formulas": [
      "Mean (Average) = Sum of all values / Number of values",
      "Weighted Average = (Value1 * Weight1 + Value2 * Weight2 + ...) / (Weight1 + Weight2 + ...)",
      "Median (Middle value of a sorted data set)",
      "Mode (Most frequently occurring value in a data set)"
    ]
  },
  "percentages": {
    "topic": "Percentages",
    "description": "Percentages represent a portion of a whole, a critical concept in both aptitude and reasoning assessments. Proficiency in percentages aids in interpreting data, solving problems related to proportions, and making informed decisions in various scenarios, including percentage change, increase, and decrease.",
    "formulas": [
      "Percentage = (Part / Whole) * 100",
      "Percentage Increase = ((New Value - Old Value) / Old Value) * 100",
      "Percentage Decrease = ((Old Value - New Value) / Old Value) * 100",
      "Expenditure Reduction Percentage = (Price Increase Percentage / (100 + Price Increase Percentage)) * 100",
      "Consumption Increase Percentage = ((Price Decrease Percentage / (100 - Price Decrease Percentage)) * 100",
      "B Less Than A Percentage = (x / (100 + x)) * 100",
      "B More Than A Percentage = (x / (100 - x)) * 100",
      "A is x% of C and B is y% of C: A = (x / y) * 100% of B",
      "Two numbers x% and y% more than the third: First = [(100 + x) / (100 + y) * 100]% of Second, Second = [(100 + y) / (100 + x) * 100]% of First"
    ]
  },
  "data-interpretation": {
    "topic": "Data Interpretation",
    "description": "Data interpretation involves analyzing, understanding, and deriving meaningful insights from data sets, which is essential in aptitude and reasoning assessments. Proficiency in data interpretation helps in solving complex problems, making logical deductions, and drawing conclusions based on available information, including charts, graphs, and tables.",
    "formulas": [
      "Simple Chart Interpretation",
      "Percentage Calculation from Graphs",
      "Comparison and Ratio Analysis from Tables",
      "Average = (Sum of Numbers) / (Number of Numbers)",
      "Average of Consecutive Numbers = (Sum of Numbers) / (Number of Consecutive Terms)",
      "Percentage Increase or Decrease = [(New Value - Old Value) / Old Value] * 100"
    ]
  },
  "number-series-word-analogy": {
    "topic": "Number series, Word Analogy",
    "description": "Topics covering number series and word analogy are vital in aptitude and reasoning assessments. Number series tests analytical skills while word analogy assesses the ability to recognize relationships between words. Proficiency in these areas enhances logical reasoning and problem-solving abilities, including alphanumeric series and word patterns.",
    "formulas": [
      "Finding the Pattern in Number Series",
      "Analogies: Word Relationships and Pairing Words",
      "Number Series Patterns:",
      "1) Based on Addition/Subtraction/Division/Multiplication",
      "2) Based on Squares /Cubes",
      "3) Based on Prime numbers /Squares /Cubes",
      "4) Based on Percentage /Decimals",
      "5) Based on Mixed/Half patterns"
    ]
  },
  "reasoning-logical-diagram-ability": {
    "topic": "Reasoning logical diagram and Reasoning ability",
    "description": "Topics related to reasoning, logical diagrams, and reasoning ability form the core of aptitude assessments. Proficiency in logical reasoning involves understanding patterns, making deductions, and drawing conclusions logically. Skills in diagrammatic reasoning aid in problem-solving by visual representation, including syllogism and logical deductions.",
    "formulas": [
      "Syllogism: Understanding Categorical Logic",
      "Analyzing Logical Diagrams and Venn Diagrams",
      "Making Inferences and Deductions",
      "Logical Diagrams and Venn Diagrams Explanation:",
      "1. If all the words are of different groups, they will be shown by the diagram as given below:",
      "   Example: Dog, Cow, Horse",
      "2. If the first word is related to the second word and the second word is related to the third word, they will be shown by a diagram as given below:",
      "   Example: Unit, Tens, Hundreds",
      "3. If two different items are completely related to the third item, they will be shown as below:",
      "   Example: Pen, Pencil, Stationery",
      "Puzzles:",
      "Blood Relations:",
      "   If A + B means A is the mother of B; A x B means A is the father of B; A $ B means A is the brother of B and A @ B means A is the sister of B, then which of the following means P is the son of Q?",
      "   (A) Q + R @ P @ N (B) Q + R * P @ N (C) Q x R $ P @ N (D) Q x R $ P $ N",
      "Direction:",
      "   - There are four main directions – East, West, North, and South.",
      "   - There are four cardinal directions – North-East (N-E), North-West (N-W), South-East (S-E), and South-West (S-W).",
      "   - At the time of sunrise, if a man stands facing the east, his shadow will be towards the west. At the time of sunset, the shadow of an object is always in the east.",
      "   - If a man stands facing the North, at the time of sunrise his shadow will be towards his left, and at the time of sunset, it will be towards his right.",
      "   - At 12:00 noon, the rays of the sun are vertically downward hence there will be no shadow.",
      "Problem: Siva starting from his house, goes 5 km in the East, then he turns to his left and goes 4 km. Finally, he turns to his left and goes 5 km. Now how far is he from his house and in what direction?",
      "   Solution: Siva is 4 km north and 5 km east from his house."
    ]
  },
  "number-system-progressions-inequalities": {
    "topic": "Number system, Progressions and Inequalities",
    "description": "Topics covering number systems, progressions, and inequalities are foundational in aptitude tests and reasoning assessments. Understanding number systems and progressions helps in solving complex mathematical problems. Inequalities contribute to logical reasoning and problem-solving skills, including arithmetic, geometric progressions, and inequalities.",
    "formulas": [
      "Number System Operations: Addition, Subtraction, Multiplication, Division",
      "Arithmetic Progression (AP): nth term = a + (n - 1) * d",
      "Geometric Progression (GP): nth term = a * r^(n-1)",
      "Inequalities: Solving and Graphical Representation"
    ]
  },
  "profit-loss-simple-interest-compound-interest": {
    "topic": "Profit and loss, Simple Interest & Compound Interest",
    "description": "Topics involving profit and loss, simple interest, and compound interest are crucial in aptitude assessments. Proficiency in these areas aids in financial calculations, decision-making, and problem-solving involving financial scenarios, including discount, mark-up, simple and compound interest calculations.",
    "formulas": [
      "Profit = Selling Price - Cost Price",
      "Loss = Cost Price - Selling Price",
      "Simple Interest = (Principal * Rate * Time) / 100",
      "Compound Interest = Principal * [(1 + Rate / 100) ^ Time - 1]"
    ]
  },
  "speed-time-distance-work": {
    "topic": "Speed, Time & Distance Time & Work",
    "description": "Topics covering speed, time, distance, and work are essential in aptitude assessments. These concepts play a significant role in problem-solving related to travel, work, and efficiency calculations in various scenarios, including relative speed, average speed, and work-efficiency problems.",
    "formulas": [
      "Speed = Distance / Time",
      "Time = Distance / Speed",
      "Work Efficiency = Work Done / Time",
      "Relative Speed = Sum of Speeds while moving in the same direction, Difference while moving in opposite directions"
    ]
  },
  "probabilities": {
    "topic": "Probabilities",
    "description": "Topics related to probabilities and likelihood are integral to aptitude and reasoning assessments. Understanding probabilities helps in decision-making, risk assessment, and predicting outcomes based on available information, including probability distributions and conditional probabilities.",
    "formulas": [
      "Probability = (Number of favorable outcomes) / (Total number of possible outcomes)",
      "Conditional Probability = P(A ∩ B) / P(B)",
      "Probability Distributions: Normal, Binomial, and Poisson"
    ]
  },
  "permutations-combinations": {
    "topic": "Permutations and Combinations",
    "description": "Topics involving permutations and combinations are crucial in aptitude assessments. Proficiency in these areas aids in problem-solving scenarios involving arrangements, selections, and possibilities, including factorial, combinations, and permutations with and without repetition.",
    "formulas": [
      "Permutation (without repetition) = n! / (n - r)!",
      "Permutation (with repetition) = n^r",
      "Combination = n! / (r! * (n - r)!)"
    ]
  },
  "clocks-calendars": {
    "topic": "Clocks and Calendars",
    "description": "Topics covering clocks and calendars are important in aptitude and reasoning assessments. These concepts are crucial for solving problems related to time, scheduling, and planning in various scenarios, including clock-based problems, calendar dates, and day calculations.",
    "formulas": [
      "Clock Problems: Angle between the hands = |(11/2) * (Hours - Minutes)|",
      "Calendar Problems: Finding Day on a Given Date, Leap Year Calculations"
    ]
  },
  "geometry-mensuration": {
    "topic": "Geometry and Mensuration",
    "description": "Topics related to geometry and mensuration are fundamental in aptitude and reasoning assessments. Proficiency in geometry aids in spatial understanding and problem-solving, while mensuration involves measurements and calculations of various shapes and figures, including area, perimeter, volume, and surface area calculations.",
    "formulas": [
      "Area Formulas: Rectangle = Length * Width, Triangle = (1/2) * Base * Height, Circle = π * Radius^2",
      "Perimeter Formulas: Rectangle = 2 * (Length + Width), Triangle = Sum of all three sides",
      "Volume Formulas: Cube = Side^3, Cylinder = π * Radius^2 * Height",
      "Surface Area Formulas: Sphere = 4 * π * Radius^2, Cuboid = 2 * (Length * Width + Width * Height + Height * Length)"
    ]
  }
}